# MIT License
#
# Copyright (c) 2023 AnonymousX1025
#
# Permission is hereby granted, free of charge, to any person obtaining a copy
# of this software and associated documentation files (the "Software"), to deal
# in the Software without restriction, including without limitation the rights
# to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
# copies of the Software, and to permit persons to whom the Software is
# furnished to do so, subject to the following conditions:
#
# The above copyright notice and this permission notice shall be included in all
# copies or substantial portions of the Software.
#
# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
# FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
# AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
# LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
# OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
# SOFTWARE.

from FallenMusic import BOT_NAME

PM_START_TEXT = """
مرحبا {0}, 🥀
๏ ᴛʜɪs ɪs** {1} !

➻ ᴀ ғᴀsᴛ ᴀɴᴅ ᴘᴏᴡᴇʀғᴜʟ ᴍᴜsɪᴄ ᴘʟᴀʏᴇʀ ʙᴏᴛ.
"""

START_TEXT = """
مرحبا {0}, 🥀
  {1} ᴄᴀɴ ɴᴏᴡ ᴩʟᴀʏ sᴏɴɢs ɪɴ {2}.

──────────────────
➻ للحصول على المساعدة، يمكنك أن تطلب مني شيئًا يمكنك الانضمام إليه [جروب الدعم]({3}).
"""

HELP_TEXT = f"""
<u>❄ الاوامر المتاحة للمستخدمين في {BOT_NAME} :</u>

๏ تشغيل : لتشغيل الموسيقي في المحادثه المرئيه .
๏ ايقاف مؤقت : لإيقاف التشغيل مؤقتا .
๏ استكمال : لإستكمال التشغيل .
๏ تخطي : لتخطي الموسيقي اللي شغاله .
๏ ايقاف : لإيقاف التشغيل نهائي .

๏ بنج : لإظهار احصائيات البنج ونظام البوت  .
๏ قائمه المطورين : لعرض قائمة مطورين البوت .

๏ تنزيل : يقوم بتنزيل الاغاني المراد تنزيلها  .

๏ بحث : للبحث علي يوتيوب واظهار النتيجه.
"""

HELP_SUDO = f"""
<u>✨  اوامر المطورين في {BOT_NAME} :</u>

๏ الاتصالات : لعرض قائمة الدردشات الصوتيه النشطة حاليا .
๏ /eval or /sh : يقوم بتشغيل الكود المحدد علي محطة البوتات .
๏ اختبار السرعه : يقوم بإختبار السرعه علي سيرفر البوتات.
๏ /sysstats : يعرض احصائيات النظام لخادم البوتات.

๏ تغير الاسم + اسم الحساب المساعد لتغير اسم الحساب المساعد .
๏ تغير البايو + بايو لتغير بايو الحساب المساعد .
๏ تغير الصوره + الرد علي صوره لتعينها علي الحساب المساعد .
๏ حذف الصوره : حذف pfp الحالي لحساب المساعد .
"""

HELP_DEV = f"""
<u>✨ اوامر المالك في {BOT_NAME} :</u>

๏ /config : للحصول علي مكونات تكوين البوت .
๏ اذاعة + رساله الاذاعه ليقوم البوت بعما اذاعه للدردشات المقدمة له .
๏ مسح التخزين المؤقت : يمسح ملفات ذاكرة التخزين المؤقت التي تم تنزيلها على خادم البوتات .
๏ غادر الكل : يأمر حساب المساعد بمغادرة جميع الدردشات .

๏ رفع مطور + يوزر شخص لاضافته الي قائمة المطورين .
๏ مسح مطور + يوزر شخص لازالته من قائمة المطورين .
"""
